{
    "description": "Hello! Welcome to my API.The Chess API provides information for chess pieces like their moves and etc.",
    "pieces": {
        "Pawn": "When a game begins, each side starts with eight pawns. White's pawns are located on the second rank, while Black's pawns are located on the seventh rank. The pawn is the least powerful piece and is worth one point. If it is a pawn's first move, it can move forward one or two squares. If a pawn has already moved, then it can move forward just one square at a time. It attacks (or captures) each square diagonally to the left or right. In the following diagram, the pawn has just moved from the e2-square to the e4-square and attacks the squares d5 and f5.",
        "Bishop": "Each side starts with two bishops, one on a light square and one on a dark square.  When a game begins, White's bishops are located on c1 and f1, while Black's bishops are located on c8 and f8. The bishop is considered a minor piece (like a knight) and is worth three points. A bishop can move diagonally as many squares as it likes, as long as it is not blocked by its own pieces or an occupied square. An easy way to remember how a bishop can move is that it moves like an X shape. It can capture an enemy piece by moving to the occupied square where the piece is located. ",
        "Knight": "Each side starts with two knights—a king's knight and a queen's knight. When a game starts, White's knights are located on b1 and g1, while Black's knights are located on b8 and g8. The knight is considered a minor piece (like a bishop) and is worth three points. The knight is the only piece in chess that can jump over another piece! It moves one square left or right horizontally and then two squares up or down vertically, OR it moves two squares left or right horizontally and then one square up or down vertically—in other words, the knight moves in an L-shape. The knight can capture only what it lands on, not what it jumps over!",
        "Rook": "Each side starts with two rooks, one on the queenside and one on the kingside. All four rooks are located in the corners of the board. White's rooks start the game on a1 and h1, while Black's rooks are located on a8 and h8. The rook is considered a major piece (like the queen) and is worth five points. It can move as many squares as it likes left or right horizontally, or as many squares as it likes up or down vertically (as long as it isn't blocked by other pieces). An easy way to remember how a rook can move is that it moves like a + sign.",
        "Queen": "The queen is the most powerful chess piece! When a game begins, each side starts with one queen. The white queen is located on d1, while the black queen is located on d8. The queen is considered a major piece (like a rook) and is worth nine points. It can move as many squares as it likes left or right horizontally, or as many squares as it likes up or down vertically (like a rook). The queen can also move as many squares as it likes diagonally (like a bishop). An easy way to remember how a queen can move is that it moves like a rook and a bishop combined!",
        "King": "The king is the most important chess piece. Remember, the goal of a game of chess is to checkmate the king! When a game starts, each side has one king. White's king is located on e1, while Black's king starts on e8. The king is not a very powerful piece, as it can only move (or capture) one square in any direction. Please note that the king cannot be captured! When a king is attacked, it is called check."
    },
    "image_path": {
        "all": "assets/images/all.jpg",
        "Pawn": "assets/images/pawn.jpg",
        "Bishop": "assets/images/bishop.jpg",
        "Knight": "assets/images/knight.jpg",
        "Rook": "assets/images/rook.jpg",
        "Queen": "assets/images/queen.jpg",
        "King": "assets/images/king.jpg"
    },
    "rules": {
        "En passant": "When a pawn advances two squares on its initial move and ends the turn adjacent to an enemy pawn on the same rank, it may be captured en passant by the enemy pawn as if it had moved only one square. This capture is legal only on the move immediately following the pawn's advance. The diagrams demonstrate an instance of this: if the white pawn moves from a2 to a4, the black pawn on b4 can capture it en passant, moving from b4 to a3, and the white pawn on a4 is removed from the board.",
        "Castling": "Castling consists of moving the king two squares towards a rook, then placing the rook on the other side of the king, adjacent to it. Castling is only permissible if all of the following conditions hold\n                        The king and rook involved in castling must not have previously moved;\n                        There must be no pieces between the king and the rook;\n                        The king may not currently be under attack, nor may the king pass through or end up in a square that is under attack by an enemy piece (though the rook is permitted to be under attack and to pass over an attacked square);\n                        The castling must be kingside or queenside ",
        "Basic moves": "Each type of chess piece has its own method of movement. A piece moves to a vacant square except when capturing an opponent's piece.\n                            Except for any move of the knight and castling, pieces cannot jump over other pieces. A piece is captured (or taken) when an attacking enemy piece replaces it on its square. The captured piece is thereby permanently removed from the game.[a] The king can be put in check but cannot be captured (see below).\n                            The king moves exactly one square horizontally, vertically, or diagonally. A special move with the king known as castling is allowed only once per player, per game (see below).\n                            A rook moves any number of vacant squares horizontally or vertically. It also is moved when castling.\n                            A bishop moves any number of vacant squares diagonally. (Thus a bishop can move to only light or dark squares, not both.)\n                            The queen moves any number of vacant squares horizontally, vertically, or diagonally.\n                            A knight moves to one of the nearest squares not on the same rank, file, or diagonal. (This can be thought of as moving two squares horizontally then one square vertically, or moving one square horizontally then two squares vertically—i.e. in an \"L\" pattern.) The knight is not blocked by other pieces; it jumps to the new location.\n                            Pawns have the most complex rules of movement:\n                                A pawn moves straight forward one square, if that square is vacant. If it has not yet moved, a pawn also has the option of moving two squares straight forward, provided both squares are vacant. Pawns cannot move backwards.\n                                A pawn, unlike other pieces, captures differently from how it moves. A pawn can capture an enemy piece on either of the two squares diagonally in front of the pawn. It cannot move to those squares when vacant except when capturing en passant.\n                            The pawn is also involved in the two special moves en passant and promotion",
        "Promotion": "If a player advances a pawn to its eighth rank, the pawn is then promoted (converted) to a queen, rook, bishop, or knight of the same color at the choice of the player (a queen is usually chosen). The choice is not limited to previously captured pieces. Hence it is theoretically possible for a player to have up to nine queens or up to ten rooks, bishops, or knights if all of the player's pawns are promoted",
        "Check": "A king is in check when it is under attack by at least one enemy piece. A piece unable to move because it would place its own king in check (it is pinned against its own king) may still deliver check to the opposing player.[16]\n                    It is illegal to make a move that places or leaves one's king in check. The possible ways to get out of check are:\n                        Move the king to a square where it is not in check.\n                        Capture the checking piece.\n                        Interpose a piece between the king and the opponent's threatening piece (block the check).\n                        In informal games, it is customary to announce \"check\" when making a move that puts the opponent's king in check. In formal competitions, however, check is rarely announced.",
        "End of the game": "If a player's king is placed in check and there is no legal move that player can make to escape check, then the king is said to be checkmated, the game ends, and that player loses.[22] Unlike the other pieces, the king is never captured."
    },
    "reference": "https://en.wikipedia.org/wiki/Rules_of_chess, https://www.chess.com/terms/chess-pieces",
    "about_me": {
        "info": "The Chess API developed by Benyamin Zojaji",
        "email": "benyamin.zojaji@yahoo.com"
    }
}
